In [40]:
import pandas as pd
import os
%xmode minimal
pd.set_option("mode.copy_on_write", True)

Exception reporting mode: Minimal

In [41]:
url = 'https://hbiostat.org/data/repo/titanic5.xlsx'
file = 'data/titanic_prepared.pickle' # Damit es local gespeichert wird

if os.path.exists(file):
    t = pd.read_pickle(file)
else:
    t = pd.read_excel(url, sheet_name='Titanic5_all', dtype_backend='numpy_nullable')
    t.to_pickle(file)
t.sample(2)

,Name_ID,Name,Sex,Age,Class,Ticket,Joined,Occupation,Boat [Body],Price,...,Title,First,DoB,Year_Birth,Date_Death,DoB_Clean,Age_F_Code,Age_F,sibsp,parch
1880,928,"HOLD, Mr Stephen",male,44.0,2,26707,Southampton,Clerk,,£26,...,Mr,Stephen,1868-01-24,<NA>,1912-04-15 00:00:00,1/24/1868,C,44.0,1,0
716,1805,"SELF, Mr Albert Charles Edward",male,24.0,E,<NA>,Southampton,Fireman,,,...,Mr,Albert Charles Edward,1888-01-11,<NA>,,1/11/1888,C,24.0,<NA>,<NA>

In [42]:
t["Sex"].unique()

<StringArray>
['female', 'male']
Length: 2, dtype: string

In [43]:
t["Sex"] = t["Sex"].map({'male':'M','female':'F'})
t.sample(2)

,Name_ID,Name,Sex,Age,Class,Ticket,Joined,Occupation,Boat [Body],Price,...,Title,First,DoB,Year_Birth,Date_Death,DoB_Clean,Age_F_Code,Age_F,sibsp,parch
1193,1910,"STANBROOK, Mr Augustus George",M,30.0,E,<NA>,Southampton,Fireman,[316],,...,Mr,Augustus George,<NA>,1881,1912-04-15 00:00:00,6/30/1881,M,30.0,<NA>,<NA>
1019,1428,"NASSER, Mr Nicholas",M,28.0,2,237736,Cherbourg,<NA>,[43],£30 1s 5d,...,Mr,Nicholas,<NA>,1884,1912-04-15 00:00:00,6/30/1884,M,27.0,1,0

In [44]:
def Alterskorrektur(a):
    return a/2 +10
    t["Age"].map()

In [45]:
Alterskorrektur(42)

31.0

Auf alle Spalten Anwenden

In [46]:
t["Age"].map(Alterskorrektur)

0       10.085
1       10.165
2        10.21
3        10.29
4        10.29
         ...
2203      <NA>
2204      <NA>
2205      <NA>
2206      <NA>
2207      <NA>
Name: Age, Length: 2208, dtype: object

In [47]:
# Oder mit Lamda
t["Age"].map(lambda x: x/2+10)

0       10.085
1       10.165
2        10.21
3        10.29
4        10.29
         ...
2203      <NA>
2204      <NA>
2205      <NA>
2206      <NA>
2207      <NA>
Name: Age, Length: 2208, dtype: object

`Apply()` ist im Vergleich zu `map()` allgemeiner. Bei gehen jede Zeile durch

Vektor Operationen

In [48]:
t.dtypes

Name_ID                 Int64
Name           string[python]
Sex                    object
Age                   Float64
Class          string[python]
Ticket         string[python]
Joined         string[python]
Occupation     string[python]
Boat [Body]    string[python]
Price          string[python]
Job            string[python]
Survived                Int64
URL            string[python]
Last           string[python]
Title          string[python]
First          string[python]
DoB            string[python]
Year_Birth     string[python]
Date_Death     string[python]
DoB_Clean      string[python]
Age_F_Code     string[python]
Age_F                 Float64
sibsp                   Int64
parch                   Int64
dtype: object

In [49]:
# Alter 10 Jahre nach dem Unglück
# Wie Broadcasting
t["Age"] + (t["Survived"] * 10)

0       10.17
1        0.33
2       10.42
3       10.58
4        0.58
        ...
2203     <NA>
2204     <NA>
2205     <NA>
2206     <NA>
2207     <NA>
Length: 2208, dtype: Float64

### String Vektor Organisation

In [50]:
# Python (noch nicht pandas)

'HorribiliKribriFax'.title() # erster Buchstabe groß, Rest klein

'Horribilikribrifax'

In [51]:
t["Name"].map(lambda x: x.title())

0       Dean, Miss Elizabeth Gladys 'Millvina'
1       Danbom, Master Gilbert Sigvard Emanuel
2                         Tannus, Master As'Ad
3       Hämäläinen, Master Viljo Unto Johannes
4                Peacock, Master Albert Edward
                         ...
2203                  Van Der Hoef, Mr Wyckoff
2204                    Wazli, Mr Yousif Ahmed
2205                   Widegren, Mr Carl Peter
2206                   Willard, Miss Constance
2207    Williams, Mr Fletcher Fellowes Lambert
Name: Name, Length: 2208, dtype: object

In [52]:
# Schöner und schneller sollte eine Vektoroperation sein
# .str --> String Vektor Funktion
t["Name"].str.title()

0       Dean, Miss Elizabeth Gladys 'Millvina'
1       Danbom, Master Gilbert Sigvard Emanuel
2                         Tannus, Master As'Ad
3       Hämäläinen, Master Viljo Unto Johannes
4                Peacock, Master Albert Edward
                         ...
2203                  Van Der Hoef, Mr Wyckoff
2204                    Wazli, Mr Yousif Ahmed
2205                   Widegren, Mr Carl Peter
2206                   Willard, Miss Constance
2207    Williams, Mr Fletcher Fellowes Lambert
Name: Name, Length: 2208, dtype: string

### Reguläre Ausdrücke

In [53]:
import re

In [54]:
name = t.loc[3]["Name"]
name

'HäMäLäINEN, Master Viljo Unto Johannes '

In [55]:
regex = re.compile(r'[,\s]+') # eins oder mehr Zeichen

In [56]:
regex.split(name.rstrip())

['HäMäLäINEN', 'Master', 'Viljo', 'Unto', 'Johannes']

In [57]:
t["Name"].str.rstrip().str.split(regex).str.join('***')

0       DEAN***Miss***Elizabeth***Gladys***'Millvina'
1       DANBOM***Master***Gilbert***Sigvard***Emanuel
2                             TANNuS***Master***As'ad
3       HäMäLäINEN***Master***Viljo***Unto***Johannes
4                  PEACOCK***Master***Albert***Edward
                            ...
2203                  VAN***DER***HOEF***Mr***Wyckoff
2204                      WAZLI***Mr***Yousif***Ahmed
2205                     WIDEGREN***Mr***Carl***Peter
2206                       WILLARD***Miss***Constance
2207    WILLIAMS***Mr***Fletcher***Fellowes***Lambert
Name: Name, Length: 2208, dtype: object

In [58]:
regex_spitzname = re.compile(r"'\w+'")
t["Name"].str.findall(regex_spitzname)

0       ['Millvina']
1                 []
2                 []
3                 []
4                 []
            ...
2203              []
2204              []
2205              []
2206              []
2207              []
Name: Name, Length: 2208, dtype: object

In [59]:
regex_spitzname = re.compile(r"'(\w+)'")
t["Name"].str.extract(regex_spitzname)

             0
0     Millvina
1         <NA>
2         <NA>
3         <NA>
4         <NA>
...        ...
2203      <NA>
2204      <NA>
2205      <NA>
2206      <NA>
2207      <NA>

[2208 rows x 1 columns]

In [60]:
regex_spitzname = re.compile(r"'(\w+)'")
t["Name"].str.replace(regex_spitzname, repl='Spitzname!', regex=True)

0       DEAN, Miss Elizabeth Gladys Spitzname!
1       DANBOM, Master Gilbert Sigvard Emanuel
2                         TANNuS, Master As'ad
3       HäMäLäINEN, Master Viljo Unto Johannes
4                PEACOCK, Master Albert Edward
                         ...
2203                  VAN DER HOEF, Mr Wyckoff
2204                    WAZLI, Mr Yousif Ahmed
2205                   WIDEGREN, Mr Carl Peter
2206                   WILLARD, Miss Constance
2207    WILLIAMS, Mr Fletcher Fellowes Lambert
Name: Name, Length: 2208, dtype: string

In [61]:
t["Name"].str.replace(r"'(\w+)'", repl='Spitzname!', regex=True)

0       DEAN, Miss Elizabeth Gladys Spitzname!
1       DANBOM, Master Gilbert Sigvard Emanuel
2                         TANNuS, Master As'ad
3       HäMäLäINEN, Master Viljo Unto Johannes
4                PEACOCK, Master Albert Edward
                         ...
2203                  VAN DER HOEF, Mr Wyckoff
2204                    WAZLI, Mr Yousif Ahmed
2205                   WIDEGREN, Mr Carl Peter
2206                   WILLARD, Miss Constance
2207    WILLIAMS, Mr Fletcher Fellowes Lambert
Name: Name, Length: 2208, dtype: string

Um reguläre Ausdrücke zu testen kann man: `www.regex101.com` verwenden

### Bins

In [62]:
bins = [0, 12, 18, 67, 100]

pd.merge(
    pd.cut(t["Age"], bins=bins) # , lables=lables
    , t["Age"]
    , left_index=True, right_index=True
).rename(columns={"Age_x":"Eimer", "Age_y":"Age"})

            Eimer   Age
0     (0.0, 12.0]  0.17
1     (0.0, 12.0]  0.33
2     (0.0, 12.0]  0.42
3     (0.0, 12.0]  0.58
4     (0.0, 12.0]  0.58
...           ...   ...
2203          NaN  <NA>
2204          NaN  <NA>
2205          NaN  <NA>
2206          NaN  <NA>
2207          NaN  <NA>

[2208 rows x 2 columns]

In [63]:
bins = [0, 12, 18, 67, 100]
labels = ['baby', 'teenager', 'worker', 'elder']

t["Age class"] = pd.cut(t["Age"], bins=bins) # , lables=lables

t.groupby(by="Age class", observed=True).size() # Observed = True um Warning zu beheben

Age class
(0, 12]       108
(12, 18]      149
(18, 67]     1892
(67, 100]       5
dtype: int64

In [64]:
t.isna().any(axis='rows')

Name_ID        False
Name           False
Sex            False
Age             True
Class          False
Ticket          True
Joined         False
Occupation      True
Boat [Body]    False
Price          False
Job             True
Survived       False
URL            False
Last           False
Title          False
First          False
DoB             True
Year_Birth      True
Date_Death     False
DoB_Clean       True
Age_F_Code     False
Age_F           True
sibsp           True
parch           True
Age class       True
dtype: bool

In [65]:
t.isna().any(axis='columns')

0       True
1       True
2       True
3       True
4       True
        ...
2203    True
2204    True
2205    True
2206    True
2207    True
Length: 2208, dtype: bool